{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "import csv, re, requests\n",
    "from rdflib import Dataset, URIRef, Literal, Namespace, RDF, RDFS, OWL, XSD\n",
    "from iribaker import to_iri\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# no need to query our own dataset\n",
    "group_numbers = range(1,12) + range(13, 20)\n",
    "groups = []\n",
    "for i, el in enumerate(group_numbers):\n",
    "    groups.append({})\n",
    "    groups[i]['endpoint'] = 'http://stardog.krw.d2s.labs.vu.nl/group' + str(el)\n",
    "    groups[i]['vocab'] = 'http://data.krw.d2s.labs.vu.nl/group' + str(el) + '/vocab/'\n",
    "    groups[i]['data'] = 'http://data.krw.d2s.labs.vu.nl/group' + str(el) + '/resource/'\n",
    "    groups[i]['number'] = el"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def runQuery(endpoint, query='', reasoning=False):\n",
    "    # Set the endpoint\n",
    "    myEndpoint = endpoint + '/query'\n",
    "    sparql = SPARQLWrapper(myEndpoint)\n",
    "    \n",
    "    # Write the query\n",
    "    if query == '':\n",
    "        query = '''\n",
    "        SELECT * WHERE {\n",
    "        ?s ?p ?o .\n",
    "        } LIMIT 10\n",
    "        '''\n",
    "    \n",
    "    # Set the query\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.addParameter('Accept','application/sparql-results+json')\n",
    "    sparql.addParameter('reasoning','true' if reasoning else 'false')\n",
    "    \n",
    "    # Return the response\n",
    "    return sparql.query().convert()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Querying Group 1...\n",
      "...Amsterdam query...\n",
      "http://data.krw.d2s.labs.vu.nl/group1/resource/AMSTERDAM http://www.w3.org/2000/01/rdf-schema#label AMSTERDAM\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 2...\n",
      "...Amsterdam query...\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 3...\n",
      "...Amsterdam query...\n",
      "http://data.krw.d2s.labs.vu.nl/group3/resource/Amsterdam http://www.w3.org/2000/01/rdf-schema#label Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group3/resource/Amsterdam/Amsterdam http://www.w3.org/2000/01/rdf-schema#label Amsterdam\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 4...\n",
      "...Amsterdam query...\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 5...\n",
      "...Amsterdam query...\n",
      "http://data.krw.d2s.labs.vu.nl/group5/resource/Amsterdam http://www.w3.org/2000/01/rdf-schema#label Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group5/resource/Amsterdam http://www.geonames.org/ontology#name Amsterdam\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 6...\n",
      "...Amsterdam query...\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 7...\n",
      "...Amsterdam query...\n",
      "http://data.krw.d2s.labs.vu.nl/group7/resource/United_States_of_America/Amsterdam http://www.w3.org/2000/01/rdf-schema#label Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group7/resource/The_Netherlands/Amsterdam http://www.w3.org/2000/01/rdf-schema#label Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group7/resource/Amsterdam http://data.krw.d2s.labs.vu.nl/group7/vocab/name Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group7/resource/AMSTERDAM http://www.w3.org/2000/01/rdf-schema#label AMSTERDAM\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 8...\n",
      "...Amsterdam query...\n",
      "http://data.krw.d2s.labs.vu.nl/group8/resource/The_Netherlands/Amsterdam http://www.w3.org/2000/01/rdf-schema#label Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group8/resource/United_States_of_America/Amsterdam http://www.w3.org/2000/01/rdf-schema#label Amsterdam\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 9...\n",
      "...Amsterdam query...\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 10...\n",
      "...Amsterdam query...\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 11...\n",
      "...Amsterdam query...\n",
      "http://data.krw.d2s.labs.vu.nl/group11/resource/Amsterdam http://data.krw.d2s.labs.vu.nl/group11/vocab/name Amsterdam\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 13...\n",
      "...Amsterdam query...\n",
      "http://data.krw.d2s.labs.vu.nl/group13/resource/AMSTERDAM http://www.w3.org/2000/01/rdf-schema#label AMSTERDAM\n",
      "http://data.krw.d2s.labs.vu.nl/group13/resource/Amsterdam http://www.w3.org/2000/01/rdf-schema#label Amsterdam\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 14...\n",
      "...Amsterdam query...\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 15...\n",
      "...Amsterdam query...\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 16...\n",
      "...Amsterdam query...\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 17...\n",
      "...Amsterdam query...\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 18...\n",
      "...Amsterdam query...\n",
      "...Amsterdam classes query...\n",
      "\n",
      "Querying Group 19...\n",
      "...Amsterdam query...\n",
      "...Amsterdam classes query...\n",
      "\n",
      "All Amsterdam URIs\n",
      "http://data.krw.d2s.labs.vu.nl/group13/resource/Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group7/resource/AMSTERDAM\n",
      "http://data.krw.d2s.labs.vu.nl/group8/resource/The_Netherlands/Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group5/resource/Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group7/resource/The_Netherlands/Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group7/resource/Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group1/resource/AMSTERDAM\n",
      "http://data.krw.d2s.labs.vu.nl/group7/resource/United_States_of_America/Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group13/resource/AMSTERDAM\n",
      "http://data.krw.d2s.labs.vu.nl/group11/resource/Amsterdam\n",
      "http://data.krw.d2s.labs.vu.nl/group8/resource/United_States_of_America/Amsterdam\n",
      "All Amsterdam URI Classes\n",
      "http://data.krw.d2s.labs.vu.nl/group7/vocab/Place\n",
      "http://data.krw.d2s.labs.vu.nl/group7/vocab/City\n",
      "http://data.krw.d2s.labs.vu.nl/group8/vocab/Place\n",
      "http://data.krw.d2s.labs.vu.nl/group5/vocab/#Municipality\n",
      "http://data.krw.d2s.labs.vu.nl/group13/vocab/City\n",
      "http://www.w3.org/2002/07/owl#Thing\n",
      "http://data.krw.d2s.labs.vu.nl/group1/vocab/City\n",
      "http://data.krw.d2s.labs.vu.nl/group11/vocab/Region\n",
      "http://data.krw.d2s.labs.vu.nl/group13/vocab/Event\n",
      "http://data.krw.d2s.labs.vu.nl/group13/vocab/Address\n",
      "http://data.krw.d2s.labs.vu.nl/group5/vocab/#Location\n",
      "Done.\n"
     ]
    }
   ],
   "source": [
    "AmsterdamURIs = set()\n",
    "AmsterdamClasses = set()\n",
    "\n",
    "for group in groups:\n",
    "    print 'Querying Group ' + str(group['number']) + '...'\n",
    "    \n",
    "    ##################################################\n",
    "    # Start with a (simple) query for Amsterdam URIs using string labels (label, name, naam)\n",
    "    ##################################################\n",
    "    print '...Amsterdam query...'\n",
    "\n",
    "    groupAmsterdamURIs = set()\n",
    "    \n",
    "    query = \"\"\"\n",
    "    PREFIX krv: <%s>\n",
    "    PREFIX krr: <%s>\n",
    "    PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "    SELECT DISTINCT ?s ?p ?o WHERE {\n",
    "        ?s ?p ?o .\n",
    "    }\n",
    "    LIMIT %d\n",
    "    \"\"\"%(group['vocab'], group['data'], 100000)\n",
    "\n",
    "    # Run the query and retrieve the response\n",
    "    response = runQuery(group['endpoint'], query)\n",
    "    \n",
    "    # Parse the response\n",
    "    for el in response['results']['bindings']:\n",
    "        sub = el['s']['value']\n",
    "        pred = el['p']['value']\n",
    "        obj = el['o']['value']\n",
    "        \n",
    "        subName = re.split('/|#', sub)[-1].strip().lower()\n",
    "        predName = re.split('/|#', pred)[-1].strip().lower()\n",
    "        objName = re.split('/|#', obj)[-1].strip().lower()\n",
    "        \n",
    "        if ((predName == 'label' or predName == 'name' or predName == 'naam') and \n",
    "            (objName == 'amsterdam')):\n",
    "            groupAmsterdamURIs.add(sub)\n",
    "            print sub, pred, obj\n",
    "    \n",
    "    ##################################################\n",
    "    # Check the classes of the Amsterdam URIs\n",
    "    ##################################################\n",
    "    print '...Amsterdam classes query...'\n",
    "    \n",
    "    for uri in groupAmsterdamURIs:\n",
    "        isClass = False\n",
    "        \n",
    "        query = \"\"\"\n",
    "        PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "        SELECT DISTINCT ?type WHERE {\n",
    "        <%s> a ?type .\n",
    "        ?type a owl:Class .\n",
    "        }\n",
    "        \"\"\"%(uri)\n",
    "        \n",
    "        response = runQuery(group['endpoint'], query, reasoning=True)\n",
    "        \n",
    "        for el in response['results']['bindings']:\n",
    "            if el['type']['value'] == 'http://www.w3.org/2002/07/owl#Nothing': break\n",
    "            AmsterdamClasses.add(el['type']['value'])\n",
    "            isClass = True\n",
    "        \n",
    "        if isClass:\n",
    "            AmsterdamURIs.add(uri)\n",
    "    \n",
    "    ##################################################\n",
    "    # More queries...\n",
    "    ##################################################\n",
    "    \n",
    "    print ''\n",
    "\n",
    "print 'All Amsterdam URIs'\n",
    "for uri in AmsterdamURIs:\n",
    "    print uri\n",
    "\n",
    "print 'All Amsterdam URI Classes'\n",
    "for uri in AmsterdamClasses:\n",
    "    print uri\n",
    "    \n",
    "print 'Done.'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
